The Rebar Shape '[Family Name]' has no matching hooks.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RebarNoMatchingHooks { get; }
  Visual Basic
Public Shared ReadOnly Property RebarNoMatchingHooks As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RebarNoMatchingHooks {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarFailures Class
  Autodesk.Revit.DB Namespace